OdDbBaseLongTransactionPE.newWorkSetIterator(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean)
\details
Creates an iterator for a specified long transaction workset.
\param pLT          [in] A pointer to a long transaction object.
\param incRemoved   [in] A flag that determines whether the iterator includes removed objects (if equal to true).
\param incSecondary [in] A flag that determines whether the iterator includes secondary objects (if equal to true).

OdDbBaseLongTransactionPE.needsFading(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdDbStub*)
\details
Check is the specified object will be faded.
\param pLT [in] A pointer to a long transaction object.
\param pId [in] A pointer to an identifier of an object.
\returns Returns true if thean object is need to fade. Otherwise returns false.
objectId must be in the same database as the the transaction.

OdDbBaseLongTransactionPE.workSetHas(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdDbStub*)
\details
Determines whether a specified long transaction object contains a specified object in its workset.
\param pLT [in] A pointer to a long transaction object.
\param pId [in] A pointer to an identifier of an object.
\returns Returns true if the long transaction workset contains the object specified with the identifier pId parameter. Otherwise returns false.

OdDbBaseLongTransactionPE.getDatabase(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns a pointer to the database, to which a specified long transaction object belongs.
\param pLT [in] A pointer to a long transaction object.

OdDbBaseLongTransactionPE.destinationBlock(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns a pointer to the identifier of a block where entities have been copied.
\param pLT [in] A pointer to a long transaction object.